# Import Libraries

In [88]:
import pandas as pd
from sklearn import linear_model
import matplotlib.pyplot as plt
from word2number import w2n
from sklearn import tree
from sklearn import metrics

# Import Data

In [89]:
df = pd.read_csv(r"F:\Machine  Learning data files\titanic.csv")

In [90]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Drop Columns

In [91]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis=1, inplace=True)

In [92]:
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [93]:
x = df.drop('Survived',axis='columns')
y = df.Survived

# Convert into Number

In [94]:
x.Sex = x.Sex.map({'male': 1, 'female': 2})

# Filling NAN values

In [95]:
x.Age = x.Age.fillna(x.Age.median())

In [96]:
x.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

# Split Train and Test Data

In [97]:
from sklearn.model_selection import train_test_split

In [98]:
X_train, X_test, y_train, y_test = train_test_split( x, y, test_size=0.2,random_state=1)

In [99]:
len(X_train)

712

In [100]:
len(X_test)

179

# Import Decision Tree

In [101]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

# Model Fit

In [102]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [103]:
model.score(X_test,y_test)

0.7653631284916201